In [1]:
%run -i scripts.py

In [2]:
df = pd.DataFrame({
    'a': [1, 2, 3],
    'b': ["a", "b", "c"]})

In [3]:
%%sql
SELECT
    *
FROM
    df
WHERE 1=1
    AND a IN (1, 2)

In [6]:
df2 = sql.result

df2.head()

   a  b
0  1  a
1  2  b